interfaces/vasp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-23 Thu 13:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Description of VASP interface to CC4S</title>
<meta name="generator" content="Org mode" />

    <meta charset='UTF-8'>
    <meta name='apple-mobile-web-app-capable' content='yes'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <link
      href='https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css'
      rel='stylesheet'
      integrity='sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU'
      crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">

  <nav class='navbar navbar-expand-lg navbar-light bg-light'>
    <div class='container-fluid'>
      <a class='navbar-brand' href='#'>
        Cc4s
      </a>
      <button class='navbar-toggler' type='button'
              data-bs-toggle='collapse'
              data-bs-target='#navbarSupportedContent'
              aria-controls='navbarSupportedContent'
              aria-expanded='false'
              aria-label='Toggle navigation'>
        <span class='navbar-toggler-icon'></span>
      </button>
      <div class='collapse navbar-collapse' id='navbarSupportedContent'>
        <ul class='navbar-nav me-auto mb-2 mb-lg-0'>
          <li class='nav-item'>
            <a class='nav-link' aria-current='page' href='/user-manual/index.html'>
              <i class='fa fa-home'></i>
              Home
            </a>
          </li>
          <li class='nav-item'>
            <a class='nav-link' href='/user-manual/sitemap.html'>
              <i class='fa fa-sign-out'></i>
              Sitemap
            </a>
          </li>
        </ul>
      </div>
    </div>
  </nav>
</div>
<div id="content">
<h1 class="title">Description of VASP interface to CC4S</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4fa6f68">1. Introduction: the example of solid boron nitride</a></li>
<li><a href="#orga889db5">2. Hartree-Fock ground state</a>
<ul>
<li><a href="#org7c65ba0">2.1. occupied orbitals</a></li>
<li><a href="#orgaf9fd55">2.2. unoccupied orbitals</a></li>
</ul>
</li>
<li><a href="#orgf87cbeb">3. Calculating Coulomb vertices</a></li>
<li><a href="#org3c88570">4. Work flow for optional steps</a>
<ul>
<li><a href="#orgf2ed51c">4.1. reducing the number of unoccupied HF orbitals using natural orbitals</a></li>
<li><a href="#org7c63e19">4.2. focal point basis set correction</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4fa6f68" class="outline-2">
<h2 id="org4fa6f68"><span class="section-number-2">1</span> <a href="#org4fa6f68">Introduction: the example of solid boron nitride</a></h2>
<div class="outline-text-2" id="text-1">
<p>
Here we describe how to use cc4s in combination with the Vienna Ab initio Simulation Package (VASP).
This page essentially explains the VASP work flow to calculate occupied and unoccupied one-electron Hartree-Fock orbitals, as well as all necessary input files for cc4s.
The entire workflow is also available as a bash script in ??? (ToDo).
Basic knowledge with VASP is assumed.
In addition, we also refer to the <a href="https://www.vasp.at/wiki">Wiki page of VASP</a>.
</p>

<p>
We use an 8 atom supercell (<code>POSCAR</code> file) of the cubic phase of solid boron nitride as an example.
</p>

<p>
&lt;poscar&gt;=
</p>
<div class="org-src-container">
<pre class="src src-sh" id="orgee0cf89">cBN
3.615
1.000 0.000 0.000
0.000 1.000 0.000
0.000 0.000 1.000
4 4
direct
0.000 0.000 0.000
0.500 0.500 0.000
0.000 0.500 0.500
0.500 0.000 0.500
0.250 0.250 0.250
0.750 0.750 0.250
0.250 0.750 0.750
0.750 0.250 0.750
</pre>
</div>

<p>
We chose a \(\Gamma\) -point only sampling of the Brillouine zone.
</p>

<p>
&lt;kpoints&gt;=
</p>
<div class="org-src-container">
<pre class="src src-sh" id="org24f1ba5">k-mesh
0
gamma
1 1 1
</pre>
</div>

<p>
Please make sure that a correctly merged <code>POTCAR</code> file is available in your working directory for boron (N) and nitrogen (N): e.g. <code>B_GW/POTCAR</code> and <code>N_GW_new/POTCAR</code> from the folder of your VASP copy. 
</p>
</div>
</div>

<div id="outline-container-orga889db5" class="outline-2">
<h2 id="orga889db5"><span class="section-number-2">2</span> <a href="#orga889db5">Hartree-Fock ground state</a></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7c65ba0" class="outline-3">
<h3 id="org7c65ba0"><span class="section-number-3">2.1</span> <a href="#org7c65ba0">occupied orbitals</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
We initialize the Hartree-Fock (HF) step by a preceding DFT (density functional theory) ground state calculation using the following INCAR file. 
The individual flags will be explained below.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgc251b0c">ENCUT   = $<span style="color: #8b4513;">encut</span>
NCORE   = $<span style="color: #8b4513;">ncore</span>
ISMEAR  = 0
SIGMA   = 0.001
</pre>
</div>

<p>
Although not essential, the DFT preparation usually increases the stability of the subsequent HF iteration procedure in VASP.
The produced <code>WAVECAR</code> file is then read in the HF step for which we use the following INCAR file.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgbc69cc8">ENCUT   = $<span style="color: #8b4513;">encut</span>
NCORE   = $<span style="color: #8b4513;">ncore</span>
ISMEAR  = 0
SIGMA   = 0.001

ALGO    = A
EDIFF   = 1E-7
LHFCALC = T
AEXX    = 1.0
NCORE   = $<span style="color: #8b4513;">ncore</span>
</pre>
</div>

<p>
The tag <code>ENCUT</code> defines the plane-wave basis set size by a kinetic energy cutoff in eV. 
It is advisable to set <code>ENCUT</code> to a value which is at least 20% larger than the largest <code>ENMAX</code> entry in the <code>POTCAR</code> file.
We therefore chose <code>ENCUT=550</code>.
For optimal MPI performance on parallel machines set <code>NCORE</code> to the number of cores per socket. 
The <code>ISMEAR</code> and <code>SIGMA</code> ensure integer occupancies of the one-electron orbitals and can safely be used for all insulating systems with a finite band gap.
We recommend to use the conjugated gradient algorithm for the iterative HF procedure by setting <code>ALGO=A</code>.
For properly converged HF orbital energies, we chose a break condition of \(10^{-7}\,\text{eV}\) by setting <code>EDIFF=1E-7</code>.
Further information to the used tags can be found in the VASP wiki.
</p>
</div>
</div>


<div id="outline-container-orgaf9fd55" class="outline-3">
<h3 id="orgaf9fd55"><span class="section-number-3">2.2</span> <a href="#orgaf9fd55">unoccupied orbitals</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Since the coupled cluster theory approximates the many-electron wave function by excited Slater determinants (in a style comparible to the configuration interaction method), all unoccupied HF orbitals have to be calclated in the given plane-wave basis.
The exact number of HF bands is equal to the number of plane-waves and can be found in the OUTCAR of the HF ground state in the following way:
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgd519eb8"><span style="color: #8b4513;">nplw</span>=<span style="font-weight: bold;">`awk '/number of plane-waves:/ {print $5} ' &lt; OUTCAR # OUTCAR file from HF ground state calculation</span>
<span style="font-weight: bold;">nbands=$(echo "($nplw * 2 / $mpiranks) + 1" | bc) # include this factor 2 in gamma-only code version</span>
<span style="font-weight: bold;">nbands=$(echo "$nbands * $mpiranks" | bc)</span>
</pre>
</div>

<p>
Please note, that the number of bands must be a multiple of the number of MPI ranks in VASP calculations for reasons of parallelization.
Additionally, a factor of 2 has to be included in the gamma-only code version of VASP.
</p>

<p>
Ensure that the <code>WAVECAR</code> stems from the previous HF calculation and use the following INCAR file to calculate the unoccupied HF orbitals:
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org4173063">ENCUT   = $<span style="color: #8b4513;">encut</span>
NCORE   = $<span style="color: #8b4513;">ncore</span>
ISMEAR  = 0
SIGMA   = 0.001

ALGO    = Exact
LHFCALC = T
AEXX    = 1.0
NCORE   = $<span style="color: #8b4513;">ncore</span>
NBANDS  = $<span style="color: #8b4513;">nbands</span>
NELM    = 1
</pre>
</div>

<p>
Here, an exact diagonalisation (<code>ALGO=Exact</code>) of the Fock matrix with dimension <code>$nbands x $nbands</code> is performed.
This is a one-shot step, i.e. no iterations are necessary: <code>NELM=1</code>.
Please save the <code>WAVECAR</code> file with all unoccupied (virtual) orbitals, e.g. <code>mv WAVECAR WAVECAR.HFV</code>.
</p>
</div>
</div>
</div>


<div id="outline-container-orgf87cbeb" class="outline-2">
<h2 id="orgf87cbeb"><span class="section-number-2">3</span> <a href="#orgf87cbeb">Calculating Coulomb vertices</a></h2>
<div class="outline-text-2" id="text-3">
<p>
Use the <code>WAVECAR</code> file with the full HF orbitals, e.g. <code>cp WAVECAR.HFV WAVECAR</code>
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org4913d70">ENCUT   = $<span style="color: #8b4513;">encut</span>
NCORE   = $<span style="color: #8b4513;">ncore</span>
ISMEAR  = 0
SIGMA   = 0.001

ALGO        = FTODDUMP
EDIFF       = 1E-5
NBANDS      = $<span style="color: #8b4513;">nbands</span>
PRECFOCK    = Normal
ENCUTGW     = $<span style="color: #8b4513;">encutgw</span>
ENCUTGWSOFT = $<span style="color: #8b4513;">encutgw</span>
ISYM        = -1
</pre>
</div>
</div>
</div>


<div id="outline-container-org3c88570" class="outline-2">
<h2 id="org3c88570"><span class="section-number-2">4</span> <a href="#org3c88570">Work flow for optional steps</a></h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf2ed51c" class="outline-3">
<h3 id="orgf2ed51c"><span class="section-number-3">4.1</span> <a href="#orgf2ed51c">reducing the number of unoccupied HF orbitals using natural orbitals</a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-org7c63e19" class="outline-3">
<h3 id="org7c63e19"><span class="section-number-3">4.2</span> <a href="#org7c63e19">focal point basis set correction</a></h3>
<div class="outline-text-3" id="text-4-2">
<p>
TODO
Use the <code>WAVECAR</code> file with the full HF orbitals, e.g. <code>cp WAVECAR.HFV WAVECAR</code>
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org89625b5">ENCUT   = $<span style="color: #8b4513;">encut</span>
NCORE   = $<span style="color: #8b4513;">ncore</span>
ISMEAR  = 0
SIGMA   = 0.001

ALGO        = FTODDUMP
NBANDS      = $<span style="color: #8b4513;">nbands</span>
PRECFOCK    = Normal
ENCUTGW     = $<span style="color: #8b4513;">encutgw</span>
ENCUTGWSOFT = $<span style="color: #8b4513;">encutgw</span>
ISYM        = -1
LSFACTOR    = T
</pre>
</div>

<p>
this step the following files will be written that are needed for CC4S
</p>

<dl class="org-dl">
<dt>\(F_{pq}\)</dt><dd><code>FockOperator.yaml</code>, <code>FockOperator.dat</code></dd>
<dt>\(\vec G\)</dt><dd><code>GridVectors.yaml</code>, <code>GridVectors.dat</code></dd>
<dt>\(V(\vec G)\)</dt><dd><code>CoulombPotential.yaml</code>, <code>CoulombPotential.dat</code></dd>
<dt>\(\delta^{ab}_{ij}\)</dt><dd><code>DeltaPPHH.yaml</code>, <code>DeltaPPHH.dat</code></dd>
<dt>\(\delta_{ij}\)</dt><dd><code>DeltaHH.yaml</code>, <code>DeltaHH.dat</code></dd>
<dt>(no term)</dt><dd><code>CoulombVertexSingularVectors.yaml</code>, <code>CoulombVertexSingularVectors.dat</code></dd>
<dt>\(\Gamma^{pG}_{q}\)</dt><dd><code>CoulombVertex.yaml</code>, <code>CoulombVertex.dat</code></dd>
<dt>\(\epsilon_{p}\)</dt><dd><code>EigenEnergies.yaml</code>, <code>EigenEnergies.dat</code></dd>
<dt>(no term)</dt><dd><code>Spins.yaml</code>, <code>Spins.dat</code></dd>
</dl>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-12-23 Thu 13:40</p>
</div>
</body>
</html>
